# Mask R-CNN with resnet-50 (v1), configured for the Cityscapes Dataset.

model {
  faster_rcnn {
    num_classes: 11
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 1024
        max_dimension: 2048
      }
    }
    feature_extractor {
      type: 'faster_rcnn_resnet50'
      first_stage_features_stride: 16
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        scales: [0.25, 0.5, 1.0, 2.0]
        aspect_ratios: [0.5, 1.0, 2.0]
        height_stride: 16
        width_stride: 16
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7
    first_stage_max_proposals: 300
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 14
    maxpool_kernel_size: 2
    maxpool_stride: 2
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        use_dropout: false
        dropout_keep_probability: 1.0
        predict_instance_masks: true
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        conv_hyperparams {
          op: CONV
          initializer {
            truncated_normal_initializer {
              stddev: 0.01
            }
          }
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
        }
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
    second_stage_mask_loss_weight: 1.0
  }
}

train_config: {
  batch_queue_capacity: 64
  batch_size: 1
  optimizer {
    momentum_optimizer: {
      learning_rate: {
        manual_step_learning_rate {
          initial_learning_rate: 0.001
          schedule {
            step: 0
            learning_rate: .001
          }
          schedule {
            step: 180000
            learning_rate: .0001
          }
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "data/resnet_v1_50.ckpt"
  from_detection_checkpoint: false
  num_steps: 240000
  data_augmentation_options {
  }
  save_interval_secs: 1200
}

train_input_reader: {
  min_after_dequeue: 32
  queue_capacity: 64
  load_instance_masks: true
  tf_record_input_reader {
    input_path: "data/records/cityscapes_train/*"
  }
  label_map_path: "data/cityscapes_label_map.pbtxt"
}

eval_config: {
  num_examples: 50
  eval_instance_masks: true
}

eval_input_reader: {
  min_after_dequeue: 1
  queue_capacity: 2
  num_readers: 1
  tf_record_input_reader {
    # Use subsampled validation set for faster monitoring
    input_path: "data/records/cityscapes_mini/*"
  }
  label_map_path: "data/cityscapes_label_map.pbtxt"
  shuffle: false
}
