# Mask R-CNN with resnet-50-FPN, configured for the Cityscapes Dataset.

model {
  faster_rcnn {
    num_classes: 11
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 375
        max_dimension: 1242
      }
    }
    feature_extractor {
      type: 'faster_rcnn_resnet50_fpn'
    }
    first_stage_anchor_generator {
      fpn_anchor_generator {
        scales: [2.0, 1.0, 0.5, 0.25, 0.125]
        aspect_ratios: [0.5, 1.0, 2.0]
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7
    first_stage_max_proposals: 1000
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 14
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        use_dropout: false
        dropout_keep_probability: 1.0
        mask_prediction_conv_depth: 256
        num_layers_before_mask_prediction: 4
        predict_instance_masks: true
        predict_instance_motions: true
        fpn_fc_branch: true
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        conv_hyperparams {
          op: CONV
          initializer {
            truncated_normal_initializer {
              stddev: 0.01
            }
          }
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
        }
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SOFTMAX
    }
    second_stage_batch_size: 512
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
    second_stage_mask_loss_weight: 1.0
  }
}

train_config: {
  batch_queue_capacity: 64
  batch_size: 1
  optimizer {
    momentum_optimizer: {
      learning_rate: {
        manual_step_learning_rate {
          initial_learning_rate: 0.00125
          schedule {
            step: 0
            learning_rate: .00125
          }
          schedule {
            step: 144000
            learning_rate: .000125
          }
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "data/resnet_v1_50.ckpt"
  from_detection_checkpoint: false
  num_steps: 192000
  save_interval_secs: 1200
}

train_input_reader: {
  load_instance_masks: true
  tf_record_input_reader {
    input_path: "data/records/vkitti_train/*"
  }
  label_map_path: "data/vkitti_label_map.pbtxt"
}

eval_config: {
  num_examples: 50
  eval_instance_masks: true
}

eval_input_reader: {
  min_after_dequeue: 1
  queue_capacity: 2
  num_readers: 1
  tf_record_input_reader {
    # Use subsampled validation set for faster monitoring
    input_path: "data/records/vkitti_val/*"
  }
  label_map_path: "data/vkitti_label_map.pbtxt"
  shuffle: false
}
